In [1]:
import pandas as pd
import numpy as np

## Loading the Dataset

In [10]:
df=pd.read_csv("Employee.csv")
df.head()

,Emp_ID,Name,Age,Salary(INR),Experience(Years),City,Department,Performance Rating
0,101,Hari,34,170000,0,Bangalore\n,Male,4.5
1,102,NaN,28,140000,3,Pune,Female,3.8
2,103,]sjayam,38,190000,2,New Delhi,Female,4.9
3,104,hero,27,135000,5,New Delhi,Male,NaN
4,105,bishu,24,120000,2,NaN,Male,5.0

In [9]:
df.head()

,Emp_ID,Name,Age,Salary(INR),Experience(Years),City,Department,Performance Rating
0,101,Hari,34,170000,0,Bangalore\n,Male,4.5
1,102,NaN,28,140000,3,Pune,Female,3.8
2,103,]sjayam,38,190000,2,New Delhi,Female,4.9
3,104,hero,27,135000,5,New Delhi,Male,NaN
4,105,bishu,24,120000,2,NaN,Male,5.0

## Checking the missing Value

In [13]:
print('missing value in each column')
print(df.isnull().sum())

missing value in each column
Emp_ID                0
Name                  2
Age                   0
Salary(INR)           0
Experience(Years)     0
City                  3
Department            0
Performance Rating    5
dtype: int64

##

In [ ]:
# df['Salary(INR)'].fillna(df['Salary(INR)'].mean(),inplace=True)

# df['Performance Rating'].fillna(df['Performance Rating'].median(),inplace=True)
# df.replace([np.inf,-np.inf],np.nan,inplace=True)
# df.fillna(df.mean(),inplace=True)

# #remove duplicate records

# df.drop_duplicates(inplace=True)


# # replace negative salaries
# df['Salary(INR)']=np.where(df['Salary(INR)']<0,df['Salary(INR)'].mean(),df['Salary(INR)'])
# salary_mean=df['Salary(INR)'].mean()
# salary_std=df['Salary(INR)'].std()
# lower_bound=salary_mean-(3*salary_std)
# upper_bound=salary_mean+(3*salary_std)

# df=df[(df['Salary(INR)']>=lower_bound)&(df['Salary(INR)']<=upper_bound)]
# df.to_csv('cleaned_indian_employee.csv',index=False)
# print('data cleaning completed! saved as cleaned_indian_employee.csv')

In [26]:
# 1. HANDLE NaNs & ±∞ ----------------------------------------------------------
# Replace explicit infinities (none in this sample, but good habit)
df.replace([np.inf, -np.inf], np.nan, inplace=True)

# a) Column-specific fills
df['Salary(INR)'].fillna(df['Salary(INR)'].mean(), inplace=True)
df['Performance Rating'].fillna(df['Performance Rating'].median(), inplace=True)
# choose: drop or fill – here we'll fill with placeholders
df['Name'].fillna('Unknown', inplace=True)
df['City'].fillna('Unknown', inplace=True)
# b) Global numeric fill
num_cols = df.select_dtypes(include='number').columns
df[num_cols] = df[num_cols].fillna(df[num_cols].mean())

# 2. REMOVE DUPLICATES ---------------------------------------------------------
df.drop_duplicates(subset='Emp_ID', inplace=True)   # safer to use ID

# 3. FIX NEGATIVE SALARIES -----------------------------------------------------
mean_salary = df['Salary(INR)'].mean()
df.loc[df['Salary(INR)'] < 0, 'Salary(INR)'] = mean_salary

# 4. CLIP 3-SIGMA OUTLIERS -----------------------------------------------------
sal_mean = df['Salary(INR)'].mean()
sal_std  = df['Salary(INR)'].std()
low, high = sal_mean - 3*sal_std, sal_mean + 3*sal_std
df = df[df['Salary(INR)'].between(low, high)]

# 5. TRIM WHITESPACE, FIX NEWLINES IN TEXT -------------------------------------
# Strip spaces/newlines in string columns
str_cols = df.select_dtypes(include='object').columns
df[str_cols] = df[str_cols].apply(lambda col: col.str.strip())

# 6. STANDARDISE CATEGORICALS (optional) --------------------------------------
df['City'] = (df['City']
              .str.replace(r'\s+', ' ', regex=True)   # collapse double spaces
              .str.title())                           # Bangalore, Pune, etc.

# 7. SAVE ----------------------------------------------------------------------
df.to_csv('cleaned_indian_employee.csv', index=False)
print("✅ Data cleaning completed! Saved as cleaned_indian_employee.csv")

✅ Data cleaning completed! Saved as cleaned_indian_employee.csv

C:\Users\LOQ\AppData\Local\Temp\ipykernel_9308\1641070699.py:6: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Salary(INR)'].fillna(df['Salary(INR)'].mean(), inplace=True)
C:\Users\LOQ\AppData\Local\Temp\ipykernel_9308\1641070699.py:7: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Performance Rating'].fillna(df['Performance Rating'].median(), inplace=True)
C:\Users\LOQ\AppData\Local\Temp\ipykernel_9308\1641070699.py:9: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Name'].fillna('Unknown', inplace=True)
C:\Users\LOQ\AppData\Local\Temp\ipykernel_9308\1641070699.py:10: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['City'].fillna('Unknown', inplace=True)

In [27]:
df.isnull().sum()

Emp_ID                0
Name                  0
Age                   0
Salary(INR)           0
Experience(Years)     0
City                  0
Department            0
Performance Rating    0
dtype: int64